; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph0 - mode
	image2 - mode
	infrared1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star2 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star17)
)
(:goal (and
	(pointing satellite0 Star11)
	(have_image Planet7 spectrograph0)
	(have_image Planet8 spectrograph0)
	(have_image Planet9 spectrograph0)
	(have_image Phenomenon10 image2)
	(have_image Star11 spectrograph0)
	(have_image Planet12 infrared1)
	(have_image Phenomenon13 image2)
	(have_image Planet14 spectrograph0)
	(have_image Star15 image2)
	(have_image Star16 spectrograph0)
	(have_image Star17 image2)
))

)

; plan
1. (turn_to satellite0 groundstation4 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 planet9 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet9)
   goals met: 0 of 12
5. (take_image satellite0 planet9 instrument0 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 1 of 12
6. (turn_to satellite0 planet8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet8)
   goals met: 1 of 12
7. (take_image satellite0 planet8 instrument0 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 2 of 12
8. (turn_to satellite0 planet7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet7)
   goals met: 2 of 12
9. (take_image satellite0 planet7 instrument0 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 3 of 12
10. (turn_to satellite0 planet14 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet14)
   goals met: 3 of 12
11. (take_image satellite0 planet14 instrument0 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 4 of 12
12. (turn_to satellite0 planet12 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet12)
   goals met: 4 of 12
13. (take_image satellite0 planet12 instrument0 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 5 of 12
14. (turn_to satellite0 phenomenon13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 12
15. (take_image satellite0 phenomenon13 instrument0 image2)
   added: (have_image phenomenon13 image2)
   goals met: 6 of 12
16. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 12
17. (take_image satellite0 phenomenon10 instrument0 image2)
   added: (have_image phenomenon10 image2)
   goals met: 7 of 12
18. (turn_to satellite0 star15 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star15)
   goals met: 7 of 12
19. (take_image satellite0 star15 instrument0 image2)
   added: (have_image star15 image2)
   goals met: 8 of 12
20. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 8 of 12
21. (take_image satellite0 star16 instrument0 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 9 of 12
22. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 9 of 12
23. (take_image satellite0 star17 instrument0 image2)
   added: (have_image star17 image2)
   goals met: 10 of 12
24. (turn_to satellite0 star11 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star11)
   goals met: 11 of 12
25. (take_image satellite0 star11 instrument0 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 12 of 12
